In [152]:
import pandas as pd
import numpy as np

In [153]:
main_sheet_input = str(input('Enter main sheet name (5XX.xlsx)'))
response_sheet_input = str(input('Enter response sheet name (5XX (Responses).xlsx)'))

In [154]:
#importing and cleaning sheets
main_sheets, response_sheets = pd.read_excel(main_sheet_input, index_col=None).drop(0).reset_index(drop=True), pd.read_excel(response_sheet_input, index_col=None)
main_sheets.columns, response_sheets.columns = ['No', 'Name', 'Image Number'], ['Time', 'Agreement', 'Name', 'Gender', 'Position', 'Image Number', 'Personal number','Home number', 'Email', 'Address']
main_sheets.head()

    No                Name Image Number
0  1.0  ANSON LIM YEK PONG       1027.0
1  2.0      ENG NG JUN WEI       1034.0
2  3.0       FONG JIA CONG       1028.0
3  4.0        GAN YONG TAI       1030.0
4  5.0         GOH XING ZE       1023.0

In [155]:
response_sheets.head()

,Time,Agreement,Name,Gender,Position,Image Number,Personal number,Home number,Email,Address
0,2021-07-12 13:27:32.845,I have read ALL the guidelines mentioned above.,ANSON LIM YEK PONG,Male | Lelaki,NaN,1027.0,0129815425,NaN,m-2182919@moe-dl.edu.my,"34, Lrg SELESA 3, Tmn SELESA ALMA, 14000, B.M"
1,2021-07-16 17:29:14.985,I have read ALL the guidelines mentioned above.,ENG NG JUN WEI,Male | Lelaki,NaN,1034.0,018-4636266,NaN,Junweieng@gmail.co.,"56, Lrg Impian Indah 16, Tmn Impian Indah, 140..."
2,2021-07-12 15:46:56.206,I have read ALL the guidelines mentioned above.,FONG JIA CONG,Male | Lelaki,NaN,1028.0,011-11059160,NaN,fongjiacong13@gmail.com,"16, Lrg Santuari 4, Tmn Santuari, 14000 B.M."
3,2021-07-16 17:33:55.004,I have read ALL the guidelines mentioned above.,GAN YONG TAI,Male | Lelaki,NaN,1030.0,010-8686563,-,ganyongtai04@gmail.com,"55, Lrg Damai 2, Tmn Permata, 14000 B.M."
4,2021-07-13 12:09:03.615,I have read ALL the guidelines mentioned above.,GOH XING ZE,Male | Lelaki,NaN,1023.0,0125839553,NaN,xingze0313@gmail.com,"5,Jln Saujana 1/1, Tmn Saujana Indah, 14000 BM"

In [156]:
response_image_number = response_sheets['Image Number']
main_image_number = main_sheets['Image Number']

In [157]:
response_image_number.head()

0    1027.0
1    1034.0
2    1028.0
3    1030.0
4    1023.0
Name: Image Number, dtype: float64

In [158]:
main_image_number.head()

0    1027.0
1    1034.0
2    1028.0
3    1030.0
4    1023.0
Name: Image Number, dtype: object

In [159]:
response_image_number == main_image_number

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
19    True
20    True
21    True
22    True
23    True
24    True
25    True
26    True
27    True
28    True
29    True
30    True
31    True
32    True
33    True
34    True
35    True
36    True
37    True
Name: Image Number, dtype: bool